[{"title": "Robotic Toolkit Added to NASA's Mars 2020 Rover", "preview": "The bit carousel, which lies at the heart of the rover's Sample Caching System, is now aboard NASA's newest rover. "}, {"title": "NASA's New Mars Rover Is Ready for Space Lasers", "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."}, {"title": "NASA's Treasure Map for Water Ice on Mars", "preview": "A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up."}, {"title": "NASA's Curiosity Keeps Rolling As Team Operates Rover From Home", "preview": "The team has learned to meet new challenges as they work remotely on the Mars mission."}, {"title": "NASA Prepares for Moon and Mars With New Addition to Its Deep Space Network", "preview": "Robotic spacecraft will be able to communicate with the dish using radio waves and lasers."}, {"title": "3 Things We've Learned From NASA's Mars InSight ", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title": "Mars Is Getting a New Robotic Meteorologist", "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."}, {"title": "Meet the People Behind NASA's Perseverance Rover", "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}, {"title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "6 Things to Know About NASA's Ingenuity Mars Helicopter", "preview": "The first helicopter attempting to fly on another planet is a marvel of engineering. Get up to speed with these key facts about its plans."}, {"title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space", "preview": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."}]